In [1]:
import pandas as pd

y = pd.Period('2016')
y

Period('2016', 'A-DEC')

In [2]:
y.start_time

Timestamp('2016-01-01 00:00:00')

In [3]:
y.end_time

Timestamp('2016-12-31 23:59:59.999999999')

In [4]:
dir(y)

['__add__',
 '__array_priority__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__radd__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rsub__',
 '__setattr__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__weakref__',
 '_add_offset',
 '_add_timedeltalike_scalar',
 '_dtype',
 '_from_ordinal',
 '_maybe_convert_freq',
 '_require_matching_freq',
 'asfreq',
 'day',
 'day_of_week',
 'day_of_year',
 'dayofweek',
 'dayofyear',
 'days_in_month',
 'daysinmonth',
 'end_time',
 'freq',
 'freqstr',
 'hour',
 'is_leap_year',
 'minute',
 'month',
 'now',
 'ordinal',
 'quarter',
 'qyear',
 'second',
 'start_time',
 'strftime',
 'to_timestamp',
 'week',
 'weekday',
 'weekofyear',
 'year']

In [5]:
 y.is_leap_year

True

In [6]:
y.week

52

In [7]:
m = pd.Period('2011-01',freq='M')

In [8]:
m

Period('2011-01', 'M')

In [9]:
d = pd.Period('2024-11',freq='D')

In [10]:
d

Period('2024-11-01', 'D')

In [11]:
d+1

Period('2024-11-02', 'D')

In [12]:
d+3

Period('2024-11-04', 'D')

In [13]:
q = pd.Period('2024Q1')

In [14]:
q

Period('2024Q1', 'Q-DEC')

In [15]:
q.end_time

Timestamp('2024-03-31 23:59:59.999999999')

In [16]:
idx = pd.period_range('2022','2024',freq='Q')
idx

PeriodIndex(['2022Q1', '2022Q2', '2022Q3', '2022Q4', '2023Q1', '2023Q2',
             '2023Q3', '2023Q4', '2024Q1'],
            dtype='period[Q-DEC]')

In [17]:
import numpy as np
ps = pd.Series(np.random.randn(len(idx)),idx)
ps

2022Q1   -0.956845
2022Q2    1.012904
2022Q3   -0.524129
2022Q4    1.197964
2023Q1    0.151084
2023Q2   -0.373291
2023Q3   -1.465621
2023Q4   -0.384268
2024Q1   -0.714536
Freq: Q-DEC, dtype: float64

In [19]:
ps['2022':'2023']

2022Q1   -0.956845
2022Q2    1.012904
2022Q3   -0.524129
2022Q4    1.197964
2023Q1    0.151084
2023Q2   -0.373291
2023Q3   -1.465621
2023Q4   -0.384268
Freq: Q-DEC, dtype: float64

In [20]:
pst = ps.to_timestamp()
pst

2022-01-01   -0.956845
2022-04-01    1.012904
2022-07-01   -0.524129
2022-10-01    1.197964
2023-01-01    0.151084
2023-04-01   -0.373291
2023-07-01   -1.465621
2023-10-01   -0.384268
2024-01-01   -0.714536
Freq: QS-OCT, dtype: float64

In [21]:
pst.index

DatetimeIndex(['2022-01-01', '2022-04-01', '2022-07-01', '2022-10-01',
               '2023-01-01', '2023-04-01', '2023-07-01', '2023-10-01',
               '2024-01-01'],
              dtype='datetime64[ns]', freq='QS-OCT')

In [22]:
import pandas as pd
df = pd.read_csv('wmt.csv')
df

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117542
1  Expenses   86544   89485   87484   97743   87688
2    Profit   29360   31369   30695   33193   29854

In [23]:
df.set_index('Line Item', inplace=True)

In [24]:
df

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117542
Expenses    86544   89485   87484   97743   87688
Profit      29360   31369   30695   33193   29854

In [25]:
df = df.T
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [29]:
df.index = pd.PeriodIndex(df.index,freq='Q-JAN')
df.index

PeriodIndex(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='period[Q-JAN]')

In [32]:
df['start date'] = df.index.map(lambda x: x.start_time)
df

Line Item  Revenue  Expenses  Profit start date
2017Q1      115904     86544   29360 2016-02-01
2017Q2      120854     89485   31369 2016-05-01
2017Q3      118179     87484   30695 2016-08-01
2017Q4      130936     97743   33193 2016-11-01
2018Q1      117542     87688   29854 2017-02-01

In [33]:
df['end date'] = df.index.map(lambda x: x.end_time)
df

Line Item  Revenue  Expenses  Profit start date                      end date
2017Q1      115904     86544   29360 2016-02-01 2016-04-30 23:59:59.999999999
2017Q2      120854     89485   31369 2016-05-01 2016-07-31 23:59:59.999999999
2017Q3      118179     87484   30695 2016-08-01 2016-10-31 23:59:59.999999999
2017Q4      130936     97743   33193 2016-11-01 2017-01-31 23:59:59.999999999
2018Q1      117542     87688   29854 2017-02-01 2017-04-30 23:59:59.999999999